# @Author: Jiang Guoxi
# @Date:   2016-07-14 11:56:28
# @Last Modified by:   Jiang Guoxi
# @Last Modified time: 2016-07-14 12:21:03

echo ------------------ command line arguments ------------------;

# $n n => \d 代表传入命令行的第n个参数
echo $1 $2 $3;

# $# The number of the arguments passed by the cli

echo ------------------ 参数个数 ------------------;
echo $#;


echo ------------------ 参数的字符串表示 ------------------;
# $* 以一个单字符串显示所有向脚本传递的参数
echo $*;


echo ------------------ 当前进程的id号 ------------------;
# $$ 当前进程的id号 非当前终端进程的id号
echo $$;
# 这两个用了好像没用 。
echo ------------------ 后台运行的最后一个进程的id号 ------------------;
# $! 当前进程的id号 非当前终端进程的id号
echo $!;
# 这两个用了好像没用 。
# * 表示'1 2 3' @ 表示'1', '2', '3'
echo ------------------ 当前进程的id号 ------------------;
# $$ 当前进程的id号 非当前终端进程的id号
echo "$@";

echo ------------------ 显示Shell使用的当前选项 ------------------;
# $- 显示Shell使用的当前选项
echo $-

name='Jiangxi';
readonly $name;
unset $name; # 居然不是错误？

echo ------------------- '*' 和 @ 示例 ------------------------;
# 这里直接用* 的话表示当前目录下的所有文件的文件名？
echo --------------------     '*'      ------------------------;
for i in "$*"; do # 注意需要在for ... in .. 后面加分号
  echo $i;
done;

echo --------------------      @     ------------------------;

for i in "$@"; do
  echo $i;
done;


echo ------------------ 当前进程的退出状况 ------------------;
# $? 当前进程的退出状况， 0表示没有错误
echo $?;

echo ------------------ 当前目录下的文件 --------------------;

for file in *; do
  echo $file;
done;
